### Part 1 :
- Theory and predict titanic survival using naive bayes

### Part 2 :
- Build email spam detector

<h1><center>PART 1</center></h1>

You all know that when you flip a coin the probability of getting head or tail is 1 by 2 because there are two possible outcomes and the chance of getting head or tail is 50%.

Similarly , When you pick a random card , what is the probability of getting a **queen** ?
  
- It's very simple there are total 4 queens 52 cards hence the probability of getting Queen.
    P(queen) = 4/52 = 1/13

Pic a random card, you know what it is a **diamond**. Now what is the probability of that card being a **queen** ?

This is called a **Conditional Probability** where you know even is A occurred and then now you are trying to predict the probability of B.

    Total Diamonds = 13

    Queen = 1
    
    P(queen/diamond) = 1/13  That is Conditional Probability
    
**P(A/B) = Probability of event A knowing that event B has already occured**

                P(B/A) * P(A) 
      P(A/B) = ---------------
                     P(B)
                     
                     
                          P(diamond/queen) * P(queen)
      P(queen/diamond) = ------------------------------
                                   P(diamond)
                                   
- P(diamond/queen) = 1/4
- P(queen) = 1/13
- P(diamond) = 1/4

<h3><center>We Have a data set About Titanic Crash</center></h3>

There are name of the people along with certain features. Here we can use Bayes Theorem where we are trying to find probability of survival based on the features such as if the person was male the class age cabin fare and so on 

                    Survived
      P(------------------------------------)
         Male & Class & Age & Cabin & Fare
         
      Make a naive assumption that features such as male, class, age, cabin, fare etc. are independent of each other

In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [15]:
target = df.Survived
input = df.drop('Survived',axis='columns')

In [16]:
dummies = pd.get_dummies(input.Sex, dtype=int)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [17]:
input = pd.concat([input,dummies],axis='columns')
input.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [18]:
input.drop('Sex',axis='columns',inplace=True)
input.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [19]:
input.columns[input.isna().any()]
# When you run it , it tells us that each column has some na values
# And I'm just curious to find out what those values are

Index(['Age'], dtype='object')

In [20]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [21]:
input.Age = input.Age.fillna(input.Age.mean())
input.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [30]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input,target,test_size=0.2)

In [23]:
len(X_train)

712

In [24]:
len(X_test)

179

In [25]:
len(input)

891

 All right ! Time to Create Naive Bayes Model

In [26]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [27]:
model.fit(X_train,y_train)

GaussianNB()

In [31]:
model.score(X_test,y_test)

0.7932960893854749

In [32]:
X_test[:10]

     Pclass        Age     Fare  female  male
60        3  22.000000   7.2292       0     1
889       1  26.000000  30.0000       0     1
42        3  29.699118   7.8958       0     1
354       3  29.699118   7.2250       0     1
676       3  24.500000   8.0500       0     1
756       3  28.000000   7.7958       0     1
791       2  16.000000  26.0000       0     1
440       2  45.000000  26.2500       1     0
785       3  25.000000   7.2500       0     1
810       3  26.000000   7.8875       0     1

In [33]:
y_test[:10]

60     0
889    1
42     0
354    0
676    0
756    0
791    0
440    1
785    0
810    0
Name: Survived, dtype: int64

In [34]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0])

<h1><center>PART 2</center></h1>

In [1]:
import pandas as pd
df = pd.read_csv('spam.csv')
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [2]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4